In [2]:
import pandas as pd

In [3]:
df=pd.read_excel("titanic.xlsx")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
#independent variables stored in inputs
#dependent var stored in target
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [7]:
#converting labels into numbers
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [8]:
#filling NaN n age column with its mean
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [9]:
inputs.head(20)

    Pclass  Sex        Age     Fare
0        3    1  22.000000   7.2500
1        1    2  38.000000  71.2833
2        3    2  26.000000   7.9250
3        1    2  35.000000  53.1000
4        3    1  35.000000   8.0500
5        3    1  29.699118   8.4583
6        1    1  54.000000  51.8625
7        3    1   2.000000  21.0750
8        3    2  27.000000  11.1333
9        2    2  14.000000  30.0708
10       3    2   4.000000  16.7000
11       1    2  58.000000  26.5500
12       3    1  20.000000   8.0500
13       3    1  39.000000  31.2750
14       3    2  14.000000   7.8542
15       2    2  55.000000  16.0000
16       3    1   2.000000  29.1250
17       2    1  29.699118  13.0000
18       3    2  31.000000  18.0000
19       3    2  29.699118   7.2250

In [10]:
#spliting traing and testing data sets
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [11]:
len(X_train)

712

In [12]:
len(X_test)

179

In [13]:
#prediction througth decision tree classifier
from sklearn import tree

In [14]:
#creating a model
model=tree.DecisionTreeClassifier()

In [15]:
#training
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [17]:
#accuracy
model.score(X_test,y_test)

0.7877094972067039

In [18]:
model.predict([[1,1,30,30]])

array([1], dtype=int64)